import 'package:flutter/material.dart';
import 'package:islam/screens/home/widgets/azkarcard.dart';

class azkarSabah extends StatelessWidget {
  const azkarSabah({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: Colors.grey,
      body: SafeArea(
        child: SingleChildScrollView(
          child: Column(
            children: [
              Container(
                height: 150,
                width: double.infinity,
                decoration: const BoxDecoration(
                  color: Colors.greenAccent,
                  borderRadius: BorderRadius.only(
                      bottomLeft: Radius.circular(30),
                      bottomRight: Radius.circular(30)),
                ),
                child:const Center(
                  child: Padding(
                    padding: EdgeInsets.symmetric(horizontal: 10),
                    child: Text('عن أبي هريرة رضي الله عنه قال: كان رسول الله صلى الله عليه وسلم يعلِّم أصحابه يقول: ((إذا أصبح أحدكم، فليقل: اللهمَّ بك أصبحنا، وبك أمسينا، وبك نحيا وبك نموت وإليك المصير، وإذا أمسى فليقل: اللهمَّ بك أمسينا وبك أصبحنا وبك نحيا وبك نموت وإليك النشور رواه الترمذي وصحَّحه الألباني.'
                    ,textAlign: TextAlign.center,
                    style: TextStyle(
                      fontSize: 15,
                      fontWeight: FontWeight.w700
                    ),
                    ),
                  ),
                ),
              ),
              const cardazkar(
                  number: 1,
                  text:
                      'أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِي \nمِاللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.',
                  index: 0),
              cardazkar(
                  number: 3,
                  text:
                      'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n قل هو ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.',
                  index: 2),
              const cardazkar(
                  number: 3,
                  text:
                      'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ',
                  index: 3),
              const cardazkar(
                  number: 3,
                  text:
                      'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\nقُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.',
                  index: 4),
              const cardazkar(
                  number: 1,
                  text:
                      'أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربّ أسألك خير ما في هذا اليوم وخير ما بعده وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربّ أعوذ بك من الكسل وسوء الكبر، ربّ أعوذ بك من عذاب في النار وعذاب في القبر.',
                  index: 5),
              const cardazkar(
                  number: 1,
                  text:
                      'اللهـم أنت ربـي لا إله إلا أنت ، خلقتنـي وأنا عبـدك ، وأنا علـى عهـدك ووعـدك ما استـطعـت ، أعـوذ بك من شـر ما صنـعت ، أبـوء لـك بنعـمتـك علـي وأبـوء بذنـبي فاغفـر لي فإنـه لا يغـفر الذنـوب إلا أنت .',
                  index: 6),
              const cardazkar(
                  number: 3,
                  text:
                      'رضيـت بالله ربـا وبالإسلام ديـنا وبمحـمد صلى الله عليه وسلم نبيـا.',
                  index: 7),
              const cardazkar(
                  number: 4,
                  text:
                      'اللهـم إنـي أصبـحت أشـهدك ، وأشـهد حملـة عـرشـك ، وملائكتك ، وجمـيع خلـقك ، أنـك أنـت الله لا إله إلا أنـت وحـدك لا شريك لـك ، وأن محمـدا عبـدك ورسـولـك.',
                  index: 8),
              const cardazkar(
                  number: 1,
                  text:
                      'اللهـم ما أصبـح بي مـن نعـمة أو بأحـد مـن خلـقك ، فمـنك وحـدك لا شريك لـك ، فلـك الحمـد ولـك الشكـر.',
                  index: 9),
              const cardazkar(
                  number: 7,
                  text:
                      'حسبـي الله لا إله إلا هو علـيه توكـلت وهو رب العرش العظـيم.',
                  index: 10),
              const cardazkar(
                  number: 3,
                  text:
                      'بسـم الله الذي لا يضـر مع اسمـه شيء في الأرض ولا في السمـاء وهـو السمـيع العلـيم.',
                  index: 11),
              const cardazkar(
                  number: 1,
                  text:
                      'اللهـم بك أصـبحنا وبك أمسـينا ، وبك نحـيا وبك نمـوت وإلـيك النـشور.',
                  index: 12),
              const cardazkar(
                  number: 1,
                  text:
                      'أصبـحـنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفا مسلما وما كان من المشركين.',
                  index: 13),
              const cardazkar(
                  number: 3,
                  text:
                      'سبحـان الله وبحمـده عدد خلـقه ، ورضـا نفسـه ، وزنـة عـرشـه ، ومـداد كلمـاتـه.',
                  index: 14),
              const cardazkar(
                  number: 3,
                  text:
                      'اللهـم عافـني في بدنـي ، اللهـم عافـني في سمـعي ، اللهـم عافـني في بصـري ، لا إله إلا أنـت.',
                  index: 15),
              const cardazkar(
                  number: 3,
                  text:
                      'اللهـم إنـي أعـوذ بك من الكـفر ، والفـقر ، وأعـوذ بك من عذاب القـبر ، لا إله إلا أنـت.',
                  index: 16),
              const cardazkar(
                  number: 1,
                  text:
                      'اللهـم إنـي أسـألـك العـفو والعـافـية في الدنـيا والآخـرة ، اللهـم إنـي أسـألـك العـفو والعـافـية في ديني ودنـياي وأهـلي ومالـي ، اللهـم استـر عـوراتي وآمـن روعاتـي ، اللهـم احفظـني من بـين يدي ومن خلفـي وعن يمـيني وعن شمـالي ، ومن فوقـي ، وأعـوذ بعظمـتك أن أغـتال من تحتـي.',
                  index: 17),
              const cardazkar(
                  number: 3,
                  text:
                      'يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كله ولا تكلني إلى نفسي طـرفة عين.',
                  index: 18),
              const cardazkar(
                  number: 1,
                  text:
                      'أصبـحـنا وأصبـح المـلك لله رب العـالمـين ، اللهـم إنـي أسـألـك خـير هـذا الـيوم ، فـتحه ، ونصـره ، ونـوره وبـركتـه ، وهـداه ، وأعـوذ بـك مـن شـر ما فـيه وشـر ما بعـده.',
                  index: 19),
              const cardazkar(
                  number: 1,
                  text:
                      'اللهـم عالـم الغـيب والشـهادة فاطـر السماوات والأرض رب كـل شـيء ومليـكه ، أشهـد أن لا إلـه إلا أنت ، أعـوذ بك من شـر نفسـي ومن شـر الشيـطان وشركه ، وأن أقتـرف علـى نفسـي سوءا أو أجـره إلـى مسـلم.',
                  index: 20),
              const cardazkar(
                  number: 3,
                  text:
                      'أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.',
                  index: 21),
              const cardazkar(
                  number: 7,
                  text: 'اللهم صل وسلم وبارك على نبينا محمد.',
                  index: 22),
              const cardazkar(
                  number: 3,
                  text:
                      'اللهم إنا نعوذ بك من أن نشرك بك شيئا نعلمه ، ونستغفرك لما لا نعلمه.',
                  index: 23),
              const cardazkar(
                  number: 3,
                  text:
                      'اللهم إني أعوذ بك من الهم والحزن، وأعوذ بك من العجز والكسل، وأعوذ بك من الجبن والبخل، وأعوذ بك من غلبة الدين، وقهر الرجال.',
                  index: 24),
              const cardazkar(
                  number: 3,
                  text:
                      'أستغفر الله العظيم الذي لا إله إلا هو، الحي القيوم، وأتوب إليه.',
                  index: 25),
              const cardazkar(
                  number: 3,
                  text:
                      'يا رب , لك الحمد كما ينبغي لجلال وجهك , ولعظيم سلطانك.',
                  index: 26),
              const cardazkar(
                  number: 3,
                  text: 'اللهم إني أسألك علما نافعا، ورزقا طيبا، وعملا متقبلا.',
                  index: 27),
              const cardazkar(
                  number: 1,
                  text:
                      'اللهم أنت ربي لا إله إلا أنت ، عليك توكلت ، وأنت رب العرش العظيم , ما شاء الله كان ، وما لم يشأ لم يكن ، ولا حول ولا قوة إلا بالله العلي العظيم , أعلم أن الله على كل شيء قدير ، وأن الله قد أحاط بكل شيء علما , اللهم إني أعوذ بك من شر نفسي ، ومن شر كل دابة أنت آخذ بناصيتها ، إن ربي على صراط مستقيم.',
                  index: 28),
              const cardazkar(
                  number: 100,
                  text:
                      'لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.',
                  index: 29),
              const cardazkar(
                  number: 100,
                  text: 'سُبْحـانَ اللهِ وَبِحَمْـدِهِ.',
                  index: 30),
            ],
          ),
        ),
      ),
    );
  }
}
